; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	spectrograph1 - mode
	spectrograph0 - mode
	thermograph2 - mode
	spectrograph3 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation0 - direction
	Phenomenon8 - direction
	Star9 - direction
	Star10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 spectrograph3)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation0)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(pointing satellite0 Planet15)
	(have_image Phenomenon8 thermograph2)
	(have_image Star9 spectrograph3)
	(have_image Star10 thermograph2)
	(have_image Planet11 spectrograph1)
	(have_image Planet12 spectrograph3)
	(have_image Planet13 spectrograph3)
	(have_image Phenomenon14 spectrograph3)
	(have_image Planet15 thermograph2)
))

)

; plan
1. (turn_to satellite0 groundstation0 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 9
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite0 instrument1 groundstation0)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite0 planet13 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet13)
   goals met: 0 of 9
5. (take_image satellite0 planet13 instrument1 spectrograph3)
   added: (have_image planet13 spectrograph3)
   goals met: 1 of 9
6. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 1 of 9
7. (take_image satellite0 planet12 instrument1 spectrograph3)
   added: (have_image planet12 spectrograph3)
   goals met: 2 of 9
8. (turn_to satellite0 planet11 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet11)
   goals met: 2 of 9
9. (take_image satellite0 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 3 of 9
10. (turn_to satellite0 phenomenon14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 phenomenon14)
   goals met: 3 of 9
11. (take_image satellite0 phenomenon14 instrument1 spectrograph3)
   added: (have_image phenomenon14 spectrograph3)
   goals met: 4 of 9
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 9
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 9
14. (turn_to satellite0 groundstation4 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 groundstation4)
   goals met: 4 of 9
15. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 4 of 9
16. (turn_to satellite0 phenomenon8 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 9
17. (take_image satellite0 phenomenon8 instrument0 thermograph2)
   added: (have_image phenomenon8 thermograph2)
   goals met: 5 of 9
18. (turn_to satellite0 star10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star10)
   goals met: 5 of 9
19. (take_image satellite0 star10 instrument0 thermograph2)
   added: (have_image star10 thermograph2)
   goals met: 6 of 9
20. (turn_to satellite0 star9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star9)
   goals met: 6 of 9
21. (take_image satellite0 star9 instrument0 spectrograph3)
   added: (have_image star9 spectrograph3)
   goals met: 7 of 9
22. (turn_to satellite0 planet15 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 planet15)
   goals met: 8 of 9
23. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 9 of 9
